const courses = [
  {
    name: "Мануальное тестирование ПО",
    img: "img/section-courses/manual-course.png",
    sessionCount: 25,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/manual-qa",
  },

  {
    name: "Курс по Java для тестировщиков",
    img: "img/section-courses/java-qa-course.png",
    sessionCount: 11,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/java-qa",
  },

  {
    name: "Курс по JavaScript для тестировщиков",
    img: "img/section-courses/js-course.png",
    sessionCount: 9,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/js-qa",
  },

  {
    name: "Курс по Python для тестировщиков",
    img: "img/section-courses/python-qa-course.png",
    sessionCount: 10,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/py-qa",
  },

  {
    name: "Автоматизация тестирования ПО на Java",
    img: "img/section-courses/se-java-course.png",
    sessionCount: 21,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/java-qa-automation",
  },

  {
    name: "Автоматизация тестирования ПО на JavaScript",
    img: "img/section-courses/se-js-course.png",
    sessionCount: 7,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/js-qa-automation",
  },

  {
    name: "Автоматизация тестирования ПО на Python",
    img: "img/section-courses/se-py-course.png",
    sessionCount: 7,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/py-qa-automation",
  },

  {
    name: "Нагрузочное тестирование с помощью JMeter",
    img: "img/section-courses/jmeter-course.png",
    sessionCount: 10,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "",
  },

  {
    name: "Тестирование АПИ с помощью утилиты Postman",
    img: "img/section-courses/postman-course.png",
    sessionCount: 8,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/postman",
  },

  {
    name: "Тестирование вебсервисов с помощью утилиты SoapUI",
    img: "img/section-courses/soapui-course.png",
    sessionCount: 6,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/soapui",
  },

  {
    name: "Курс по Chrome devTools и FireBug",
    img: "img/section-courses/chrome-devtools-firebug-course.png",
    sessionCount: 5,
    summary:
      "Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей. Текст генерируется абзацами случайным образом от двух до десяти предложений в абзаце, что позволяет сделать текст более привлекательным и живым для визуально-слухового восприятия." +
      "По своей сути рыбатекст является альтернативой традиционному lorem ipsum, который вызывает у некторых людей недоумение при попытках прочитать рыбу текст. В отличии от lorem ipsum, текст рыба на русском языке наполнит любой макет непонятным смыслом и придаст неповторимый колорит советских времен.",
    redirectPageClickOnImg: "",
    redirectPageClickOnSubscribe: "",
    redirectClickOnDetails: "/courses/dev-tools",
  },
];

let showCourses = array => {
  clearDiv("courses");
  for (let i = 0; i < array.length; i++) {
    document.getElementById("courses").innerHTML +=
      "<div class='courses-wide__row'>" +
      "   <div class='courses-wide__row-container'>" +
      "       <div class='row valign-wrapper p-3 course-border'>" +
      "           <div class='col-sm-12 col-md-4 courses-wide__row-image'>" +
      "               <a href='#!' data-target='#demo'>" +
      "                   <img src='" +
      array[i].img +
      "' alt width'100' height='100' style='opacity: 1;'>" +
      "               </a>" +
      "           </div>" +
      "           <div class='col-sm-12 col-md-4'>" +
      "               <h3 class='courses-wide__row-title'>" +
      array[i].name +
      "</h3>" +
      "               <p class='courses-wide__row-text'>Количество обучающих сессий: " +
      array[i].sessionCount +
      "</p>" +
      "           </div>" +
      "           <div class='col-sm-12 col-md-4 courses-wide__row-btn'>" +
      "               <div class='gdlr-course-button'>" +
      "                   <button type='button' class='btn btn-primary' data-toggle='collapse' data-target='#demo" +
      i +
      "'>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;О курсе&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</button>" +
      "               </div>" +
      "               <div class='gdlr-course-button'>" +
      "                   <a href='/login" +
      array[i].redirectPageClickOnSubscribe +
      "' class='btn btn-courses'>Подписаться</a>" +
      "               </div>" +
      "           </div>" +
      "           <div id='demo" +
      i +
      "' class='collapse course-details'><p>" +
      array[i].summary +
      "</p>'" +
      "               <a href='" +
      array[i].redirectClickOnDetails +
      "' class='course-details-link'>детальнее></a>" +
      "           </div>" +
      "       </div>" +
      "   </div>" +
      "</div>";
  }
};

document.addEventListener("DOMContentLoaded", showCourses(courses));
